Revit 2027 API
ParameterTypeId.StructuralFoundationThickness Property
 "Foundation Thickness"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralFoundationThickness { get; }
Public Shared ReadOnly Property StructuralFoundationThickness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralFoundationThickness {
	ForgeTypeId^ get ();
}
static member StructuralFoundationThickness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace